testing_DoNotInclude/loadtest_streamer.yml
config:
    target: "ws://127.0.0.1:8913?token=00050ab05fdd2f6488bf1ecacb2b233f"
    phases:
      - duration: 20  # Test for 20 seconds
        arrivalRate: 1 # Every second, add 10 users
        rampTo: 1 # Ramp it up to 100 users over the 20s period
        name: "Ramping up the load"
scenarios:
  - engine: "ws"
    flow:
      - send: {one: "hi," , two: "make"}
      - think: 1
      - send: {one: "hi," , two: "make"}
      - think: 2
      - send: {one: "hi," , two: "make"}
      - think: 3
      - send: {one: "hi," , two: "make"}
      - think: 4
      - send: {one: "hi," , two: "make"}
      - think: 5